test_app/app/controllers/tasks_controller.rb

    def index
        @tasks = Task.order(:position)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."position" ASC

    def new
        @count = Task.count
---
SELECT COUNT(*) FROM "tasks"

    def create
        @task = Task.new(task_params)
        if @task.save
---
INSERT INTO "tasks" ("name", "description", "position", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "this is new"], ["description", "description"], ["position", 1], ["completed", false], ["created_at", "2023-01-28 23:18:34.755337"], ["updated_at", "2023-01-28 23:18:34.755337"]]

    def update
        @task = Task.find(params[:id])
        if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "description CHANGED"], ["updated_at", "2023-01-28 23:18:43.965453"], ["id", 1]]

    def delete
        @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]